<h1>Tips & Trick -> Python Pandas<h1>

<h2>#5 Membalik Urutan baris & kolom pada data frame<h2>

In [19]:
# Import modules
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.3
1.21.2

In [20]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                  columns=cols)
df

   A  B  C  D  E
0  9  3  4  3  9
1  8  3  3  1  5
2  5  3  4  9  9
3  8  6  8  1  8
4  7  5  7  5  4

<h3>Membalik urutan kolom<h3>

In [21]:
df.loc[:, ::-1] # Data yang diatas dibalik / reverse
                # bagian pertama ([:,) -> mengatur baris
                # bagian kedua  (, ::-1]) -> mengatur kolom

   E  D  C  B  A
0  9  3  4  3  9
1  5  1  3  3  8
2  9  9  4  3  5
3  8  1  8  6  8
4  4  5  7  5  7

<h3>Membalik urutan baris<h3>

In [22]:
df.loc[::-1]

   A  B  C  D  E
4  7  5  7  5  4
3  8  6  8  1  8
2  5  3  4  9  9
1  8  3  3  1  5
0  9  3  4  3  9

<h3>Membalik urutan baris dan melakukan penyesuaian ulang index<h3>

In [23]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  7  5  7  5  4
1  8  6  8  1  8
2  5  3  4  9  9
3  8  3  3  1  5
4  9  3  4  3  9

<h2>#6 Mengganti nama (label) kolom pada data frame<h2>

In [24]:
# Import modules
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.3
1.21.2

In [25]:
# Persiapan data frame

n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                  columns=cols)
df

   A  B  C  D  E
0  2  2  6  4  9
1  7  8  4  5  3
2  5  8  2  8  5
3  6  3  7  4  4
4  7  8  1  2  2

<h3>Mengganti nama (label) untuk sebuah kolom pada data frame <h3>

In [26]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  2  2     6  4  9
1  7  8     4  5  3
2  5  8     2  8  5
3  6  3     7  4  4
4  7  8     1  2  2

<h3>Mengganti nama (label) untuk banyak kolom pada data frame <h3>

In [27]:
df.rename(columns={'A':'Name', 'B':'Address', 'C':'City'})

   Name  Address  City  D  E
0     2        2     6  4  9
1     7        8     4  5  3
2     5        8     2  8  5
3     6        3     7  4  4
4     7        8     1  2  2

<h2>#7 Menghapus (drop) missing values (NaN) <h2>

In [28]:
# Import modules
import pandas as pd

print(pd.__version__)

1.3.3

In [29]:
# Persiapan data frame

df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

E:\anaconda\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

        index         A         B         C         D
0  zCEzQ8pMTM  0.024635       NaN       NaN  0.261488
1  IpSK39oCUz       NaN -0.684169 -0.001738 -1.692137
2  D1dUcptd4u  1.789843  0.930190 -0.928860  0.687079
3  w99ielMWxM  1.174083 -0.402993 -0.249791  1.921919
4  rvYlAeWF43 -1.022504 -1.772755  0.547557 -0.545075

In [30]:
df = df.rename(columns={'index':'X'})
df.head()

            X         A         B         C         D
0  zCEzQ8pMTM  0.024635       NaN       NaN  0.261488
1  IpSK39oCUz       NaN -0.684169 -0.001738 -1.692137
2  D1dUcptd4u  1.789843  0.930190 -0.928860  0.687079
3  w99ielMWxM  1.174083 -0.402993 -0.249791  1.921919
4  rvYlAeWF43 -1.022504 -1.772755  0.547557 -0.545075

In [32]:
df_backup = df.copy(deep=True)

<h3>Menghapus (drop) setiap kolom yang mengandung missing values<h2>

In [33]:
df = df.dropna(axis='columns')
df.head()

            X         D
0  zCEzQ8pMTM  0.261488
1  IpSK39oCUz -1.692137
2  D1dUcptd4u  0.687079
3  w99ielMWxM  1.921919
4  rvYlAeWF43 -0.545075

<h3>Menghapus (drop) setiap baris yang mengandung missing values

In [34]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            X         A         B         C         D
2  D1dUcptd4u  1.789843  0.930190 -0.928860  0.687079
3  w99ielMWxM  1.174083 -0.402993 -0.249791  1.921919
4  rvYlAeWF43 -1.022504 -1.772755  0.547557 -0.545075
5  tPZx7Vf5PD -1.621983 -0.832692 -0.211326 -0.632984
6  r4iLto8qx7  0.222004 -0.161030  0.215719  0.208228

<h3> Persentase missing values untuk tiap kolom

In [35]:
df = df_backup.copy(deep=True)
df.isna().mean()

X    0.0
A    0.2
B    0.1
C    0.1
D    0.0
dtype: float64

<h3>Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan threshold

In [36]:
threshold = len(df) * 0.9
df = df.dropna(thresh = threshold, axis = 'columns')
df.head()

            X         B         C         D
0  zCEzQ8pMTM       NaN       NaN  0.261488
1  IpSK39oCUz -0.684169 -0.001738 -1.692137
2  D1dUcptd4u  0.930190 -0.928860  0.687079
3  w99ielMWxM -0.402993 -0.249791  1.921919
4  rvYlAeWF43 -1.772755  0.547557 -0.545075

<h2>#8 Memeriksa kesamaan antar 2 buah kolom (series) pada data frame

In [37]:
# Import modules
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.3
1.21.2

In [38]:
# Persiapan data frame
data = {'A':[15,15,18,np.nan,12],
        'B':[15,15,18,np.nan,12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

<h3> Mengenal pandas series

In [39]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [40]:
type(df['A'])

pandas.core.series.Series

In [41]:
type(df)

pandas.core.frame.DataFrame

<h3>Memeriksa kesamaan dengan operator ==<h3>

In [42]:
df['A'] == df['B']

# 3 false karena memiliki nilai NaN tidak bisa dibandingkan dengan sempurna

0     True
1     True
2     True
3    False
4     True
dtype: bool

<h3> Memeriksa kesamaan dengan method equals()

In [43]:
df['A'].equals(df['B'])

True

<h3> Memeriksa kesamaan antar 2 data frame

In [44]:
df1 = df.copy(deep = True)
df.equals(df1)

True

In [45]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True